############
# #  מחרוזת
############
'''
מחרוזות(STRINGS) הן משתנה המתאר רצף של תווים
(אותיות, מספרים וערכים שונים של ביטויים כמו רווח,סימן קריאה וכו')
ההכרזה על משתנה מסוג מחרוזת נעשית באמצעות מרכאות או גרשיים
hen = 'hen manzur'
hen2 = "hen manzur"
'''
#hen3 = '''
# hen manzur
# '''
#hen4= """
# hen manzur
# """
'''
מחרוזות ניתן לחבר כמו מספרים
print(hen + hen2 + hen3 + hen4)
fullname = hen + "love or "
age = 27.2

#מחרוזות לא ניתן לחבר עם מספרים
כדי להמיר מספר למחרוזת נרשום כך:
str(age)
וכך נוכל לחבר בין integer לstring
'''
#   ניתן להטמין פרמטרים במחרוזת:
#print("p1={},p2={},p3={},p4={red}".format(1,1.0,"hen",red="BBFD"))

#בדיקה עם מחרוזת קיימת בתוך מחרוזת: True or False
#print("hen" in "hen manzur")

#a = "hen manzur"
#print("hen manzur" in a)

#ניתן לייצג או להדפיס תווים ספציפים:
### A=0 B=1 C=2 D=3 E=4  F=5
### A=-6 B=-5 C=-4 D=-3 E=-2  F=-1  - בספירה לאחור
s1="ABCDEF"
print(s1[0]) # ידפיס רק את התו הראשון A
print(s1[-1]) # ידפיס רק את התו האחרון F (הספירה הפוכה)
#print(s1[]) # לא ניתן להדפיס ללא הכנסת ערך לסוגריים מרובעים
print(s1[1:-1]) # ידפיס טווח מהתו השני B עד התו לפני אחרון E ,עד הערך לאחר ה: ולא כולל הערך לאחר הנקודותיים
print(s1[1:]) # ידפיס טווח מהתו השני B עד התו האחרון F ,על מנת להדפיס הכל לא נרשום כלום לאחר הנקודותיים
print(s1[:]) # ידפיס הכל מהתחלה עד הסוף
print(s1[1::2]) # פעמיים נקודותיים - [2::1] ידפיס מהתו השני בקפיצות של 2
print(s1[::-1]) # פעמיים נקודותיים - [1-::] ידפיס הכל בסדר הפוך